wegam/STM32F10xUSBE/FWLIB/Lib/Protocol/USART_ISP.C
	}	
	#endif
}
/*******************************************************************************
* 函数名			:	Usart_ISP_Reset
* 功能描述		:	重置编程器---恢复所有参数为默认值
* 输入			: void
* 返回值			: void
*******************************************************************************/
u8 Usart_ISP_GetSlaveStatus(ISP_Conf_TypeDef *ISP_Conf)	//返回从机状态值
{	
	return(ISP_Conf->ISP_SLAVE_STATUS);		//返回从机状态值
}
/*******************************************************************************
* 函数名			:	Usart_ISP_Reset
* 功能描述		:	重置编程器---恢复所有参数为默认值
* 输入			: void
* 返回值			: void
*******************************************************************************/
void Usart_ISP_SetSlaveStatus(ISP_Conf_TypeDef *ISP_Conf,ISP_SLAVE_STATUS_TypeDef Status)	//设置从机状态
{	
	ISP_Conf->ISP_SLAVE_STATUS=Status;	//设置状态值
}












//------------------------------------主机专有函数
/*******************************************************************************
*函数名			:	Usart_ISP_GetDevice
*功能描述		:	启动从机设备使从机运行
*输入				: 
*返回值			:	无
*******************************************************************************/
void Usart_MISP_GetDevice(ISP_Conf_TypeDef *ISP_Conf)			//获取从机芯片信息
{
	GPIO_ResetBits(ISP_Conf->BOOT0_CTL_PORT,ISP_Conf->BOOT0_CTL_Pin);		//BOOT0拉低
	GPIO_SetBits(ISP_Conf->RESET_CTL_PORT,ISP_Conf->RESET_CTL_Pin);	//RESET脚拉高
}
/*******************************************************************************
*函数名			:	Usart_ISP_Connect
*功能描述		:	主机连接从机函数
*输入				: 
*返回值			:	无
*******************************************************************************/
void Usart_MISP_Connect(ISP_Conf_TypeDef *ISP_Conf)					//主机连接从机函数
{
		ISP_Conf->ISP_DATA.USARTSendLen=1;										//发送一字节0x7F
		ISP_Conf->ISP_DATA.ISP_TvBuffer[0]=0x7F;							//连接符
}
/*******************************************************************************
*函数名			:	Usart_ISP_Send
*功能描述		:	复位从机设备--使从机进行ISP模式
*输入				: 
*返回值			:	无
*******************************************************************************/
void Usart_MISP_ResetDevice(ISP_Conf_TypeDef *ISP_Conf)			//复位从机设备--使从机进行ISP模式
{
	GPIO_SetBits(ISP_Conf->BOOT0_CTL_PORT,ISP_Conf->BOOT0_CTL_Pin);		//BOOT0拉高
	GPIO_ResetBits(ISP_Conf->RESET_CTL_PORT,ISP_Conf->RESET_CTL_Pin);	//RESET脚拉低
}
/*******************************************************************************
*函数名			:	Usart_ISP_SetDevice
*功能描述		:	启动从机接收BOOT0使从机进行下载状态
*输入				: 
*返回值			:	无
*******************************************************************************/
void Usart_MISP_SetDevice(ISP_Conf_TypeDef *ISP_Conf)			//启动从机接收BOOT0使从机进行下载状态
{
	GPIO_SetBits(ISP_Conf->BOOT0_CTL_PORT,ISP_Conf->BOOT0_CTL_Pin);		//BOOT0拉低
	GPIO_SetBits(ISP_Conf->RESET_CTL_PORT,ISP_Conf->RESET_CTL_Pin);			//RESET脚拉高
}
/*******************************************************************************
*函数名			:	Usart_MISP_RunDevice
*功能描述		:	启动从机设备使从机正常运行
*输入				: 
*返回值			:	无
*******************************************************************************/
void Usart_MISP_RunDevice(ISP_Conf_TypeDef *ISP_Conf)			//启动从机设备使从机正常运行
{
	GPIO_ResetBits(ISP_Conf->BOOT0_CTL_PORT,ISP_Conf->BOOT0_CTL_Pin);		//BOOT0拉低
	GPIO_SetBits(ISP_Conf->RESET_CTL_PORT,ISP_Conf->RESET_CTL_Pin);			//RESET脚拉高
}
/*******************************************************************************
*函数名			:	Usart_MISP_ReadAck
*功能描述		:	主机读取从机应答
*输入				: 
*返回值			:	TRUE：有应答；FALSE：无应答
*******************************************************************************/
bool Usart_MISP_ReadAck(ISP_Conf_TypeDef *ISP_Conf)			//主机读取从机应答:有应答返回TRUE，否则返回FALSE
{
	ISP_Conf->ISP_DATA.ReceivedLen=USART_ReadBufferIDLE(ISP_Conf->USARTx,(u32*)ISP_Conf->ISP_DATA.ISP_RvBuffer,(u32*)ISP_Conf->ISP_DATA.ISP_RxBuffer);	//串口空闲模式读串口接收缓冲区，如果有数据，将数据拷贝到RevBuffer,并返回接收到的
	if(ISP_Conf->ISP_DATA.ReceivedLen)
	{
		if(ISP_Conf->ISP_DATA.ISP_RvBuffer[0]==0x79)
		{
			return TRUE;
		}
		else
		{
			return FALSE;
		}
	}
	return FALSE;
}
/*******************************************************************************
*函数名			:	Usart_MISP_StatusProcess
*功能描述		:	函数功能说明
*输入				: 
*返回值			:	无
*******************************************************************************/
void Usart_MISP_StatusProcess(ISP_Conf_TypeDef *ISP_Conf)			//启动从机设备使从机运行
{
	if(ISP_Conf->OverRunTime++>2000000)			//10S超时---应答0.5S超时
	{
		Usart_ISP_Reset(ISP_Conf);						//重置编程器---恢复所有参数为默认值
	}
	if(ISP_Conf->ISP_MASTER_STATUS==ISP_MSTATUS_IDLE)								//工作在主机模式下的空闲---准备开始检查有无从机连接
	{
		ISP_Conf->ISP_MASTER_STATUS=ISP_MSTATUS_ResetDevice;
		ISP_Conf->OverRunTime=0;						//超时时间
	}
	else if(ISP_Conf->ISP_MASTER_STATUS==ISP_MSTATUS_ResetDevice)		//执行上电复位
	{
		if(ISP_Conf->TimeCount++<10000)					//计时时间--100mS
		{			
			Usart_MISP_ResetDevice(ISP_Conf);			//复位从机设备--使从机进行ISP模式			
		}
		else
		{
			ISP_Conf->TimeCount=0;																			//计时时间--清零
			ISP_Conf->ISP_MASTER_STATUS=ISP_MSTATUS_WriteConnect;				//ISP主机准备连接----复位后检测从机
			Usart_MISP_SetDevice(ISP_Conf);															//启动从机接收BOOT0使从机进行下载状态
		}
	}
	else if(ISP_Conf->ISP_MASTER_STATUS==ISP_MSTATUS_WriteConnect)	//ISP主机准备连接----复位后检测从机
	{
		ISP_Conf->MasterLastStatus=ISP_MSTATUS_WriteConnect;					//存储主机上一个状态，根据上一个状态等到从机应答时进行下一步操作:等待应答
		ISP_Conf->ISP_MASTER_STATUS=ISP_MSTATUS_WaitAck;							//ISP主机等待从机应答
		Usart_MISP_Connect(ISP_Conf);																	//主机连接从机函数
	}
	else if(ISP_Conf->ISP_MASTER_STATUS==ISP_MSTATUS_Connectted)		//ISP主机与从机已经连接完成---准备写入数据/检查有没有读写保护，有则需要解除保护，没有就开始写数据
	{
	}
	else if(ISP_Conf->ISP_MASTER_STATUS==ISP_MSTATUS_WaitAck)				//ISP主机等待从机应答以及等待超时处理
	{
		bool Result=FALSE;				//定义布尔变量
		Result=Usart_MISP_ReadAck(ISP_Conf);					//主机读取从机应答:有应答返回TRUE，否则返回FALSE
		if(Result==TRUE)
		{
			if(ISP_Conf->MasterLastStatus==ISP_MSTATUS_WriteConnect)			//存储主机上一个状态，根据上一个状态等到从机应答时进行下一步操作:等待应答
			{
				ISP_Conf->ISP_MASTER_STATUS=ISP_MSTATUS_Connectted;			//ISP主机与从机已经连接完成
			}
		}
		else
		{
			if(ISP_Conf->MasterLastStatus==ISP_MSTATUS_WriteConnect)			//存储主机上一个状态，根据上一个状态等到从机应答时进行下一步操作:等待应答
			{
				if(ISP_Conf->TimeCount++>1000)				//计时时间--100mS,超时无应答，重新发送连接命令
				{
					ISP_Conf->TimeCount=0;							//计时时间--清零
					ISP_Conf->ISP_MASTER_STATUS=ISP_MSTATUS_WriteConnect;		//ISP主机准备连接----复位后检测从机
				}
				if(ISP_Conf->OverRunTime++>100000)				//复位后0.5秒内没连接上从机重新复位模块
				{
					Usart_ISP_Reset(ISP_Conf);							//重置编程器---恢复所有参数为默认值
				}
			}			
		}
	}
	
