wegam/STM32F10xUSBE/FWLIB/Lib/Protocol/USART_ISP.C
}
//------------------------------------公共函数
/*******************************************************************************
*函数名			:	function
*功能描述		:	发送函数包括从机发送应答、发送地址、发送命令、发送数据
*输入				: 
*返回值			:	无
*******************************************************************************/
void Usart_ISP_Send(ISP_Conf_TypeDef *ISP_Conf)						//发送函数包括从机发送应答、发送地址、发送命令、发送数据
{
	if(ISP_Conf->ISP_DATA.USARTSendLen)
	{
		memcpy(ISP_Conf->ISP_DATA.ISP_TxBuffer, ISP_Conf->ISP_DATA.ISP_TvBuffer,ISP_Conf->ISP_DATA.USARTSendLen);		//复制数据
		memset(ISP_Conf->ISP_DATA.ISP_TvBuffer,0xFF, ISP_BufferSize);	//接收缓冲区
		USART_DMASend(ISP_Conf->USARTx,(u32*)ISP_Conf->ISP_DATA.ISP_TxBuffer,ISP_Conf->ISP_DATA.USARTSendLen);			//串口DMA发送程序
		ISP_Conf->ISP_DATA.USARTSendLen=0;
	}
}

/*******************************************************************************
* 函数名			:	Usart_ISP_Reset
* 功能描述		:	重置编程器---恢复所有参数为默认值
* 输入			: void
* 返回值			: void
*******************************************************************************/
void Usart_ISP_Reset(ISP_Conf_TypeDef *ISP_Conf)	//重置编程器---恢复所有参数为默认值
{	
	ISP_Conf->ISP_DATA.OffsetAddr				=	0;			//写从机时的地址偏移
	ISP_Conf->ISP_DATA.StartAddr				=	0;			//起始地址
	ISP_Conf->ISP_DATA.GoAddr						=	0;			//复位运行起始地址
	
	ISP_Conf->ISP_DATA.ReceivedLen			=	0;			//串口接收的数据个数
	ISP_Conf->ISP_DATA.USARTSendLen			=	0;			//需要往串口发送的数据个数---//当检测到SendLen不为0时自动发送数据
	
	ISP_Conf->ISP_DATA.FLASHNumToSave		=	0;			//需要往FLASH里保存的数据个数---当此不为0时SPI-FLASH自动存储数据
	ISP_Conf->ISP_DATA.FLASHNumToRead		=	0;			//需要从FLASH里读取的数据个数---当此不为0时，SPI-FLASH自动通过WriteAddr地址从SPI-FLASH读取数据
	
	ISP_Conf->ISP_DATA.ReadAddr					=	0;			//读数据起始地址
	
	ISP_Conf->ISP_DATA.WriteAddr				=	0;			//写入数据起始地址
	ISP_Conf->ISP_DATA.WriteLen					=	0;			//需要写入的长度	

	ISP_Conf->ISP_DATA.SumHaveReceived	=	0;			//作为从机时总共接收到的数据个数
	ISP_Conf->ISP_DATA.SumHaveWritten		=	0;			//主机总共往从机写入的数据个数	
	
	ISP_Conf->ISP_FUN										=	ISP_IDLE;						//ISP状态为空闲，根据RESET接口状态和BOOT0接口状态可以切换为MASTER或者SLAVE
	ISP_Conf->ISP_SLAVE_STATUS					=	ISP_STATUS_IDLE;		//FLASH空闲状态，可以读写
	ISP_Conf->SlaveLastStatus						=	ISP_STATUS_IDLE;		//存储从机上一个状态，根据上一个状态进行下一步操作
	
	ISP_Conf->ISP_MASTER_STATUS					=	ISP_MSTATUS_IDLE;		//ISP主机空闲状态----开始写前或者写完成后状态
	ISP_Conf->MasterLastStatus					=	ISP_MSTATUS_IDLE;		//存储主机上一个状态，根据上一个状态等到从机应答时进行下一步操作
	
	ISP_Conf->OverRunTime								=	0;									//超时时间	
	ISP_Conf->TimeCount									=	0;									//计时时间	
	ISP_Conf->Connected=ISP_STATUS_UnConnect;							//ISP未连接（作为从机)
	
	memset(ISP_Conf->ISP_DATA.ISP_RxBuffer,0xFF, ISP_BufferSize);	//接收缓冲区
	memset(ISP_Conf->ISP_DATA.ISP_RvBuffer,0xFF, ISP_BufferSize);	//接收缓冲区--备份区
	memset(ISP_Conf->ISP_DATA.ISP_TxBuffer,0xFF, ISP_BufferSize);	//发送缓冲区
	memset(ISP_Conf->ISP_DATA.ISP_TvBuffer,0xFF, ISP_BufferSize);	//发送缓冲区--备份区
}




